{
  "_name_or_path": "microsoft/swin-tiny-patch4-window7-224",
  "architectures": [
    "SwinForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "depths": [
    2,
    2,
    6,
    2
  ],
  "drop_path_rate": 0.1,
  "embed_dim": 96,
  "encoder_stride": 32,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Apple/Alternaria Blotch",
    "1": "Apple/Black Rot",
    "2": "Apple/Brown Spot",
    "3": "Apple/Cedar Apple Rust",
    "4": "Apple/Frog Eye Leaf Spot",
    "5": "Apple/Grey Spot",
    "6": "Apple/Healthy",
    "7": "Apple/Leaf Rust",
    "8": "Apple/Mosaic Virus",
    "9": "Apple/Powdery Mildew",
    "10": "Apple/Scab",
    "11": "Bitter Gourd/Downey mildew",
    "12": "Bitter Gourd/Healthy",
    "13": "Bitter Gourd/Fusarium wilt",
    "14": "Bitter Gourd/Mosaic virus",
    "15": "Bottle gourd/Anthracnose",
    "16": "Bottle gourd/Downy mildew",
    "17": "Bottle gourd/Healthy",
    "18": "Cauliflower/Black Rot",
    "19": "Cauliflower/Downy mildew",
    "20": "Cauliflower/Healthy",
    "21": "Corn/Common_rust",
    "22": "Corn/Gray_leaf_spot",
    "23": "Corn/Healthy",
    "24": "Corn/Maize Chlorotic Mottle Virus",
    "25": "Cucumber/Anthracnose lesions",
    "26": "Cucumber/Downy mildew",
    "27": "Cucumber/Healthy",
    "28": "Eggplant/Begomovirus",
    "29": "Eggplant/Cercopora leaf spot",
    "30": "Eggplant/Healthy",
    "31": "Eggplant/Verticillium wilt",
    "32": "Grape/Black Rot",
    "33": "Grape/Esca",
    "34": "Grape/Healthy",
    "35": "Grape/Leaf Blight",
    "36": "Orange/Citrus canker",
    "37": "Orange/Citrus greening",
    "38": "Orange/Citrus mealybugs",
    "39": "Orange/Die back",
    "40": "Orange/Foliage damaged",
    "41": "Orange/Healthy",
    "42": "Orange/Powdery mildew",
    "43": "Orange/Shot hole",
    "44": "Orange/Spiny whitefly",
    "45": "Orange/Yellow dragon",
    "46": "Orange/Yellow leaves",
    "47": "Potato/.ipynb_checkpoints",
    "48": "Potato/Early_blight",
    "49": "Potato/Healthy",
    "50": "Potato/Late_blight",
    "51": "Rice/Bacterial Leaf Blight",
    "52": "Rice/Blast",
    "53": "Rice/Brown Spot",
    "54": "Rice/Healthy",
    "55": "Rice/Leaf Scald",
    "56": "Rice/Sheath Rot",
    "57": "Sugarcane/Healthy",
    "58": "Sugarcane/Red Rot",
    "59": "Sugarcane/Red Stripe",
    "60": "Sugarcane/Ring Spot",
    "61": "Sugarcane/Yellow leaves",
    "62": "Tomato/Bacterial Spot",
    "63": "Tomato/Early Blight",
    "64": "Tomato/Healthy",
    "65": "Tomato/Late Blight",
    "66": "Tomato/Leaf Mold",
    "67": "Tomato/Mosaic Virus",
    "68": "Tomato/Powdery Mildew",
    "69": "Tomato/Septoria Leaf Spot",
    "70": "Tomato/Two Spotted Spider Mite",
    "71": "Tomato/Yellow Leaf Curl Virus",
    "72": "Tomato/.ipynb_checkpoints",
    "73": "Tomato/Aphids",
    "74": "Tomato/Begomovirus",
    "75": "Tomato/Canker",
    "76": "Tomato/Fusarium wilt",
    "77": "Tomato/Leaf curl virus",
    "78": "Tomato/Spider Mites",
    "79": "Tomato/Spotted wilt",
    "80": "Tomato/Target Spot",
    "81": "Wheat/Healthy",
    "82": "Wheat/Leaf Rust",
    "83": "Wheat/Loose Smut",
    "84": "Wheat/Root Rot",
    "85": "Wheat/Septoria Leaf Spot",
    "86": "Wheat/Stem Rust",
    "87": "Wheat/Stripe Rust"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "Apple/Alternaria Blotch": 0,
    "Apple/Black Rot": 1,
    "Apple/Brown Spot": 2,
    "Apple/Cedar Apple Rust": 3,
    "Apple/Frog Eye Leaf Spot": 4,
    "Apple/Grey Spot": 5,
    "Apple/Healthy": 6,
    "Apple/Leaf Rust": 7,
    "Apple/Mosaic Virus": 8,
    "Apple/Powdery Mildew": 9,
    "Apple/Scab": 10,
    "Bitter Gourd/Downey mildew": 11,
    "Bitter Gourd/Healthy": 12,
    "Bitter Gourd/Fusarium wilt": 13,
    "Bitter Gourd/Mosaic virus": 14,
    "Bottle gourd/Anthracnose": 15,
    "Bottle gourd/Downy mildew": 16,
    "Bottle gourd/Healthy": 17,
    "Cauliflower/Black Rot": 18,
    "Cauliflower/Downy mildew": 19,
    "Cauliflower/Healthy": 20,
    "Corn/Common_rust": 21,
    "Corn/Gray_leaf_spot": 22,
    "Corn/Healthy": 23,
    "Corn/Maize Chlorotic Mottle Virus": 24,
    "Cucumber/Anthracnose lesions": 25,
    "Cucumber/Downy mildew": 26,
    "Cucumber/Healthy": 27,
    "Eggplant/Begomovirus": 28,
    "Eggplant/Cercopora leaf spot": 29,
    "Eggplant/Healthy": 30,
    "Eggplant/Verticillium wilt": 31,
    "Grape/Black Rot": 32,
    "Grape/Esca": 33,
    "Grape/Healthy": 34,
    "Grape/Leaf Blight": 35,
    "Orange/Citrus canker": 36,
    "Orange/Citrus greening": 37,
    "Orange/Citrus mealybugs": 38,
    "Orange/Die back": 39,
    "Orange/Foliage damaged": 40,
    "Orange/Healthy": 41,
    "Orange/Powdery mildew": 42,
    "Orange/Shot hole": 43,
    "Orange/Spiny whitefly": 44,
    "Orange/Yellow dragon": 45,
    "Orange/Yellow leaves": 46,
    "Potato/.ipynb_checkpoints": 47,
    "Potato/Early_blight": 48,
    "Potato/Healthy": 49,
    "Potato/Late_blight": 50,
    "Rice/Bacterial Leaf Blight": 51,
    "Rice/Blast": 52,
    "Rice/Brown Spot": 53,
    "Rice/Healthy": 54,
    "Rice/Leaf Scald": 55,
    "Rice/Sheath Rot": 56,
    "Sugarcane/Healthy": 57,
    "Sugarcane/Red Rot": 58,
    "Sugarcane/Red Stripe": 59,
    "Sugarcane/Ring Spot": 60,
    "Sugarcane/Yellow leaves": 61,
    "Tomato/Bacterial Spot": 62,
    "Tomato/Early Blight": 63,
    "Tomato/Healthy": 64,
    "Tomato/Late Blight": 65,
    "Tomato/Leaf Mold": 66,
    "Tomato/Mosaic Virus": 67,
    "Tomato/Powdery Mildew": 68,
    "Tomato/Septoria Leaf Spot": 69,
    "Tomato/Two Spotted Spider Mite": 70,
    "Tomato/Yellow Leaf Curl Virus": 71,
    "Tomato/.ipynb_checkpoints": 72,
    "Tomato/Aphids": 73,
    "Tomato/Begomovirus": 74,
    "Tomato/Canker": 75,
    "Tomato/Fusarium wilt": 76,
    "Tomato/Leaf curl virus": 77,
    "Tomato/Spider Mites": 78,
    "Tomato/Spotted wilt": 79,
    "Tomato/Target Spot": 80,
    "Wheat/Healthy": 81,
    "Wheat/Leaf Rust": 82,
    "Wheat/Loose Smut": 83,
    "Wheat/Root Rot": 84,
    "Wheat/Septoria Leaf Spot": 85,
    "Wheat/Stem Rust": 86,
    "Wheat/Stripe Rust": 87
  },
  "layer_norm_eps": 1e-05,
  "mlp_ratio": 4.0,
  "model_type": "swin",
  "num_channels": 3,
  "num_heads": [
    3,
    6,
    12,
    24
  ],
  "num_labels": 88,
  "path_norm": true,
  "patch_size": 4,
  "qkv_bias": true,
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4"
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.45.1",
  "use_absolute_embeddings": false,
  "window_size": 7
}
